
<template>
  <div class="wrap-xbim">
    <div class="info noselect">
      <!-- <p>鼠标左键旋转，右键拖动</p> -->
      <!-- <p>=========测试用数据==========</p> -->
      <!-- <p>加载进度:{{}}</p> -->
      <p style="font-family: Arial, Helvetica, sans-serif; margin-top: 18px;">FPS:{{ctrXbim.fps}}</p>
      <p>选中的prodId:{{ctrXbim.selectedData&&ctrXbim.selectedData.id}}</p>
      <p>选中的模型:{{ctrXbim.selectedData&&ctrXbim.selectedData.model}}</p>
      <p>当前选中的剖切面方向{{ctrXbim.lastClickId}}</p>
    </div>
    <div class="wrap-right-top noselect">
      <!-- 裁切信息 -->
      <el-card v-if="ctrXbim.flagClipping" class="box-card Sectioningbox">
        <template #header>
          <div class="card-header">
            <span>剖切信息</span>
            <el-button type="text" @click="toggleClipping">
              <i style="font-size: 20px" class="el-icon-close" />
            </el-button>
          </div>
        </template>
        <div class="main">
          <div class="box" title="创建切面" @click="toggleCreateClip(true)" :disabled="ctrXbim.clippingPlanes.length>=2">
            <svg t="1629252160463" class="icon" viewBox="0 0 1042 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="9328" width="200" height="200"><path d="M944.37744629 201.8213501l-4.41897583-2.41094971a29.3302002 29.3302002 0 0 0-6.02737427-6.02655029L761.16339599 94.1427002a29.7322998 29.7322998 0 0 0-28.12472534-1e-8L560.27097046 193.3838501l-4.82189942 4.82189941-6.83074951 4.0177002a8.83959961 8.83959961 0 0 0-4.41897583 7.63330078v16.875l-8.4375-4.82107544a29.7322998 29.7322998 0 0 0-29.7322998 0l-8.4375 4.82107544v-16.07080078a8.83959961 8.83959961 0 0 0-5.62527466-8.83959961l-6.83074951-4.0177002s-2.81222534-3.61642456-4.82025147-4.82189941L307.54724609 94.1427002a29.7322998 29.7322998 0 0 0-29.7322998-1e-8L105.04724609 193.3838501a28.92892456 28.92892456 0 0 0-6.4286499 6.4286499l-4.41979981 2.41094971a8.83959961 8.83959961 0 0 0-4.01770019 8.4375v217.3661499a8.83959961 8.83959961 0 0 0 4.4197998 7.63330078l4.41979981 2.41094971a28.52682495 28.52682495 0 0 0 6.4286499 6.4286499l172.7677002 99.2411499a29.7322998 29.7322998 0 0 0 29.7322998 0l9.64297485-5.62527466v8.4375a30.13357544 30.13357544 0 0 0 13.66149903 25.71459961l4.41897583 2.41094971-15.67034912 8.83877564a8.83959961 8.83959961 0 0 0-4.41897583 7.63412475v218.57162476a8.4375 8.4375 0 0 0 4.01770019 7.23202514 29.3302002 29.3302002 0 0 0 11.65100098 13.66067505l172.76852417 99.24114991a29.7322998 29.7322998 0 0 0 29.7322998 0l172.7677002-99.24114991a29.3302002 29.3302002 0 0 0 11.65100098-13.66149902 8.4375 8.4375 0 0 0 4.01852416-7.23120117V591.15100098a8.83959961 8.83959961 0 0 0-4.4197998-7.63412476L702.5029956 574.67974854l4.42062378-2.41094971a30.13357544 30.13357544 0 0 0 14.86532593-25.71459961v-8.4375l9.64297485 5.62527466a29.7322998 29.7322998 0 0 0 29.73229981 0l172.76770019-99.2411499a29.7322998 29.7322998 0 0 0 6.02737427-6.0265503l4.41897583-2.4109497a8.83959961 8.83959961 0 0 0 4.41979981-7.63412476v-217.76824951a8.83959961 8.83959961 0 0 0-4.41979981-8.83877564zM523.70874512 474.23229981a8.83959961 8.83959961 0 0 0-8.43750001 0l-134.99999999 75.93749999-19.68722535-11.65182495v-25.71459961l120.53594971-68.70547485 4.82107544-4.82107544 6.02655029-3.61642456a8.83959961 8.83959961 0 0 0 4.41979981-7.63330078V276.95547485l23.3036499-13.25939941 23.3036499 13.25939941v151.07162476a8.83959961 8.83959961 0 0 0 4.41979981 7.63330078l6.83074951 3.61642456a28.92892456 28.92892456 0 0 0 4.82025146 4.82107544l120.53594971 68.70547485v25.3125l-19.68722534 11.65182496z" p-id="9329"></path></svg>        </div>
          <div class="box" title="清除切面" @click="resetPlane">
            <svg t="1629249474393" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2010" width="200" height="200"><path d="M970.13086 772.288158a54.60719 54.60719 0 0 0-54.60719 53.753952v89.589921H108.361143V108.469504h85.323734A54.60719 54.60719 0 0 0 255.971203 53.862314 53.753953 53.753953 0 0 0 198.804301 0.108361H53.753953A53.753953 53.753953 0 0 0 0 53.862314v916.376907a57.166902 57.166902 0 0 0 15.358272 38.395681 57.166902 57.166902 0 0 0 38.395681 15.358272h916.376907a52.900715 52.900715 0 0 0 53.753953-53.753953V826.04211a53.753953 53.753953 0 0 0-53.753953-53.753952z" p-id="2011"></path><path d="M380.115011 575.768422m21.229905-46.584776l63.689717-139.754329q21.229906-46.584776 67.814682-25.35487l0 0q46.584776 21.229906 25.354871 67.814682l-63.689717 139.754328q-21.229906 46.584776-67.814682 25.354871l0 0q-46.584776-21.229906-25.354871-67.814682Z" p-id="2012"></path><path d="M472.890248 617.612203m-46.584776-21.229906l-139.754329-63.689717q-46.584776-21.229906-25.35487-67.814681l0 0q21.229906-46.584776 67.814682-25.354871l139.754328 63.689717q46.584776 21.229906 25.354871 67.814682l0 0q-21.229906 46.584776-67.814682 25.35487Z" p-id="2013"></path><path d="M357.506447 454.883866l96.41582-34.129494a238.906456 238.906456 0 1 1 304.605732 145.903586l34.129494 97.269057a341.294938 341.294938 0 1 0-435.151046-209.043149z" p-id="2014"></path><path d="M406.140976 437.819119m-51.194241 0a51.194241 51.194241 0 1 0 102.388481 0 51.194241 51.194241 0 1 0-102.388481 0Z" p-id="2015"></path><path d="M775.592746 615.292486m-51.194241 0a51.194241 51.194241 0 1 0 102.388481 0 51.194241 51.194241 0 1 0-102.388481 0Z" p-id="2016"></path></svg>
          </div>
          <div class="box able" :title="ctrXbim.showClipping?'隐藏剖面':'显示剖面'" @click="toggleClippingPlane" >
            <svg t="1629252202704" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10147" width="200" height="200"><path d="M394.667 560.64v-97.28l68.693-68.693h79.787l75.627-162.133h-304.32l-279.253 279.253 279.253 279.68h10.88l1.707 60.053 31.147-60.053 85.013-182.4zM988.8 511.787l-279.253-279.253h-7.36l-9.813-60.8-26.56 60.8-85.013 182.4 48.533 48.427v97.28l-68.693 68.693h-79.787l-75.627 162.133h304.32z" p-id="10148"></path></svg>
          </div>
        </div>
        <el-slider
          v-if="ctrXbim.changeClippingPrg"
          @input="changeClipPrg"
          :show-tooltip="false"
          class="mgTop8"
          v-model="progress"
          :step=".01"
        ></el-slider>
      </el-card>
      <!-- <div v-if="ctrXbim.flagClipping">
        <el-button @click="resetPlane">清除切面</el-button>
        <el-button
          @click="toggleCreateClip(true)"
          :disabled="ctrXbim.clippingPlanes.length>=2"
        >创建新切面</el-button>
        <el-button @click="toggleClippingPlane">{{ctrXbim.showClipping?'隐藏':'显示'}}剖面</el-button>
        <el-slider
          v-if="ctrXbim.changeClippingPrg"
          @input="changeClipPrg"
          :show-tooltip="false"
          class="mgTop8"
          v-model="progress"
          :step=".01"
        ></el-slider>
      </div> -->
      <!-- 信息面板 -->
      <el-card v-if="Attribute_details" shadow="always"  v-loading="loadingDetail" element-loading-text="加载属性中" element-loading-spinner="el-icon-loading" element-loading-background="rgba(0, 0, 0, 0)" class="box-card">
        <template #header>
          <div class="card-header">
            <span>信息面板</span>
            <el-button type="text" @click="remove">
              <i style="font-size: 20px" class="el-icon-close" />
            </el-button>
          </div>
        </template>
        <el-scrollbar max-height="500px">
          <div v-if="Object.keys(this.detailData).length === 0" class="Not_yet">
            <svg t="1628845369151" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3049" width="200" height="200"><path d="M512 0C230.4 0 0 230.4 0 512s230.4 512 512 512 512-230.4 512-512S793.6 0 512 0z m0 960C265.6 960 64 758.4 64 512S265.6 64 512 64s448 201.6 448 448-201.6 448-448 448z" fill="" p-id="3050"></path><path d="M512 800m-64 0a64 64 0 1 0 128 0 64 64 0 1 0-128 0Z" fill="" p-id="3051"></path><path d="M553.6 672h-83.2L448 160h128z" fill="" p-id="3052"></path></svg>
            暂无属性，请选择一个构件/零件
          </div>
          <tr class="title" v-for="(val,key) in detailData" :key="key">
            <td class="key">{{key}}</td>
            <td class="val">{{val}}</td>
          </tr>
        </el-scrollbar>
      </el-card>
      <!-- 颜色信息面板 -->
      <el-card v-if="Modeflag" class="box-card colorbox">
        <template #header>
          <div class="card-header">
            <span>颜色面板</span>
          </div>
        </template>
        <div class="item">
          <div style="width: 25px;height: 25px;background: #f52443;"></div><span class="text">运输中</span>
        </div>
        <div class="item">
          <div style="width: 25px;height: 25px;background: #f08300;"></div><span class="text">加工中</span>
        </div>
        <div class="item">
          <div style="width: 25px;height: 25px;background: #ffff24;"></div><span class="text">安装中</span>
        </div>
        <div class="item">
          <div style="width: 25px;height: 25px;background: #02b340;"></div><span class="text">未开始</span>
        </div>
        <div class="item">
          <div style="width: 25px;height: 25px;background: #79d2d2;"></div><span class="text">加工完成</span>
        </div>
        <div class="item">
          <div style="width: 25px;height: 25px;background: #2e62cd;"></div><span class="text">安装完成</span>
        </div>
        <div class="item">
          <div style="width: 25px;height: 25px;background: #cc99ff;"></div><span class="text">运输完成</span>
        </div>
      </el-card>
    </div>
    <div class="wrap-mark" v-if="ctrXbim.flagMark" :style="style"></div>
    <canvas id="xBIM-viewer" ref="canvas"></canvas>
    <!-- <canvas id="canvas" ref="canvas1" width="2000" height="300"></canvas> -->

    <div id="divcontainer">
      <div id="aaa"></div>
    </div>
    <tree
      ref="tree"
      @hideItems="hideItems"
      :treeList="dataTree"
      :displayflag="flag"
      @selInModel="selInModel"
      @doLookAt="doLookAt"
      @getDetailInfo="getDetailInfo"
    >
      <!-- <el-row class="mgTop8">
        <el-col :span="6">
          <el-button @click="printData">打印数据</el-button>
        </el-col>
        <el-col :span="6">
          <el-button
            @click="toggleMeasure"
            :type="ctrXbim.flagMeasuring?'success':'default'"
          >{{!ctrXbim.flagMeasuring?'测距模式':'退出测距'}}</el-button>
        </el-col>
        <el-col :span="6">
          <el-button
            @click="toggleClipping"
            :type="ctrXbim.flagClipping?'success':'default'"
          >{{!ctrXbim.flagClipping?'剖切模式':'退出剖切'}}</el-button>
        </el-col>
        <el-col :span="6">
          <el-button @click="toggleRotate">{{!ctrXbim.flagRotate?'旋转预览':'停止旋转'}}</el-button>
        </el-col>
      </el-row>
      <el-row class="mgTop8">
        <el-col :span="6">
          <el-button
            @click="toggleWalking"
            :type="ctrXbim.flagWalking?'success':'default'"
          >{{ctrXbim.flagWalking?'退出漫游':'进入漫游'}}</el-button>
        </el-col>
        <el-col :span="6">
          <el-button
            @click="toggleMarking"
            :type="ctrXbim.flagMarking?'success':'default'"
          >{{ctrXbim.flagMarking?'退出标记':'标记模式'}}</el-button>
        </el-col>
        <el-col :span="6">
          <el-button @click="clearMarking" type="danger">清空标记</el-button>
        </el-col>
      </el-row> -->
    </tree>

    <div class="tip-walk" v-if="ctrXbim.flagWalking">长按键盘WASD进行漫游操作</div>
    <div class="mask" v-if="loading">
      <div class="prg">
        <p>模型载入中...请稍后...</p>
      </div>
    </div>
    <!-- 工具栏 -->
    <div class="toolbar">
      <div class="bf-button gld_mode" style="" :title="Modeflag?'状态模式':'默认模式'" @click="toggleChange">
        <svg t="1629422901429" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2147" width="200" height="200"><path d="M393.846154 78.769231v866.461538H78.769231V78.769231h315.076923m78.769231-78.769231H0v1024h472.615385V0zM945.230769 78.769231v315.076923h-315.076923V78.769231h315.076923m78.769231-78.769231H551.384615v472.615385h472.615385V0zM945.230769 630.153846v315.076923h-315.076923v-315.076923h315.076923m78.769231-78.769231H551.384615v472.615385h472.615385V551.384615z" p-id="2148"></path></svg>
      </div>
      <div class="bf-button gld_measure" style="" :title="ctrXbim.flagMeasuring?'退出测量模式':'测量模式'" @click="toggleMeasure">
        <svg t="1628839845215" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1513" width="200" height="200"><path d="M294.8 22.8L23.2 294.3c-12.5 12.5-12.5 32.8 0 45.3l656.2 656.2c12.5 12.5 32.8 12.5 45.3 0l271.5-271.5c12.5-12.5 12.5-32.8 0-45.3L340 22.8c-12.5-12.5-32.8-12.5-45.2 0z m-198 288.5l215-215c3.1-3.1 8.2-3.1 11.3 0l33.9 33.9c3.1 3.1 3.1 8.2 0 11.3l-96.2 96.2 45.3 45.3 96.2-96.2c3.1-3.1 8.2-3.1 11.3 0l22.4 22.4c3.1 3.1 3.1 8.2 0 11.3l-62.2 62.2L419 328l62.2-62.2c3.1-3.1 8.2-3.1 11.3 0l22.4 22.4c3.1 3.1 3.1 8.2 0 11.3l-62.2 62.2L498 407l62.2-62.2c3.1-3.1 8.2-3.1 11.3 0l23.1 23.1c3.1 3.1 3.1 8.2 0 11.3l-96.2 96.2 45.3 45.3 96.2-96.2c3.1-3.1 8.2-3.1 11.3 0l22.4 22.4c3.1 3.1 3.1 8.2 0 11.3l-62.2 62.2 45.3 45.3 62.2-62.2c3.1-3.1 8.2-3.1 11.3 0l22.4 22.4c3.1 3.1 3.1 8.2 0 11.3l-62.2 62.2 45.3 45.3 62.2-62.2c3.1-3.1 8.2-3.1 11.3 0l23.1 23.1c3.1 3.1 3.1 8.2 0 11.3l-96.3 96 45.3 45.3 96.2-96.2c3.1-3.1 8.2-3.1 11.3 0l33.9 33.9c3.1 3.1 3.1 8.2 0 11.3l-215 215c-3.1 3.1-8.2 3.1-11.3 0L96.8 322.6a7.85 7.85 0 0 1 0-11.3z" p-id="1514"></path></svg>
      </div>
      <div class="bf-button gld_Sectioning" :title="ctrXbim.flagClipping?'退出剖切':'剖切模式'" @click="toggleClipping">
        <svg t="1628840033569" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2756" width="200" height="200"><path d="M605.440831 444.871267a32.779988 32.779988 0 0 1-12.784195-2.762885L191.757381 249.783509a30.157589 30.157589 0 0 1 0-54.508437L528.033231 2.90337a30.719532 30.719532 0 0 1 26.130333 0l393.219372 192.371702a29.548818 29.548818 0 0 1 16.670965 27.254219 30.532217 30.532217 0 0 1-16.670965 27.254218l-328.595967 191.997074a29.595646 29.595646 0 0 1-13.346138 3.324827zM274.597094 222.529291l330.796909 158.467828L865.198823 222.529291l-324.240911-158.467829z" p-id="2757"></path><path d="M605.440831 843.56958a32.779988 32.779988 0 0 1-12.784195-2.762885l-400.852426-192.371702a30.157589 30.157589 0 0 1 0-54.508437L528.033231 401.554854a30.719532 30.719532 0 0 1 26.130333 0l393.078886 192.371702a29.548818 29.548818 0 0 1 16.670965 27.254219 30.532217 30.532217 0 0 1-16.670965 27.254218l-328.595966 191.997074c-4.448713 2.200942-73.380345 3.324827-77.829058 3.324827z m-328.595966-222.388805l328.595966 158.467828L865.198823 621.180775l-324.240911-158.467829z" p-id="2758"></path><path d="M605.440831 845.81735a38.2121 38.2121 0 0 1-13.346138-2.762884l-395.326656-192.418531A30.344903 30.344903 0 1 1 223.647627 596.174327L605.440831 782.036859l315.249829-185.722047a30.344903 30.344903 0 0 1 26.692276 54.508438L618.786969 842.91398a28.84639 28.84639 0 0 1-13.346138 2.762885z" p-id="2759"></path><path d="M934.036798 645.110166a29.876618 29.876618 0 0 1-30.017104-30.017103V227.539946a30.017103 30.017103 0 0 1 60.034207 0v386.991174a30.017103 30.017103 0 0 1-30.017103 30.579046z m-732.820049 3.324827a29.876618 29.876618 0 0 1-30.017103-30.017103V227.539946a30.017103 30.017103 0 0 1 60.034207 0v390.877944a29.876618 29.876618 0 0 1-30.017104 30.017103zM90.045761 713.479855a29.876618 29.876618 0 0 1-30.017103-30.017103V292.584808a30.017103 30.017103 0 1 1 60.034206 0v390.877944a29.876618 29.876618 0 0 1-30.017103 30.017103z" p-id="2760"></path><path d="M90.045761 469.971372a29.876618 29.876618 0 0 1-30.063932-30.017103V49.076325a30.017103 30.017103 0 1 1 60.034207 0v390.877944a30.251246 30.251246 0 0 1-30.017104 30.017103zM62.791542 674.331184a30.43856 30.43856 0 0 1 40.600357-14.048566l350.83953 171.813966a30.344903 30.344903 0 1 1-26.692276 54.508437L76.699623 715.165683a30.43856 30.43856 0 0 1-14.048566-40.600356z" p-id="2761"></path><path d="M337.441014 808.541821a30.43856 30.43856 0 0 1 40.600357-14.048566l350.83953 171.813966a30.344903 30.344903 0 0 1-26.692276 54.508437l-350.83953-171.67348a30.43856 30.43856 0 0 1-14.048567-40.600357zM62.791542 29.033704a30.43856 30.43856 0 0 1 40.600357-14.048567l350.792701 171.954452a30.344903 30.344903 0 1 1-26.692276 54.508438L76.699623 69.63406A30.625875 30.625875 0 0 1 62.791542 29.033704z" p-id="2762"></path><path d="M337.441014 163.057027a30.43856 30.43856 0 0 1 40.600357-14.048567l350.83953 171.813966a30.344903 30.344903 0 0 1-26.692276 54.508438L351.349095 203.095441a29.829789 29.829789 0 0 1-14.048567-40.038414z m378.093749 856.962546a29.876618 29.876618 0 0 1-30.017104-30.017104V598.937211a30.017103 30.017103 0 1 1 60.034207 0v390.877944a29.876618 29.876618 0 0 1-30.204418 30.017104z" p-id="2763"></path><path d="M715.347448 791.870856a29.876618 29.876618 0 0 1-30.017103-30.017104V370.975808a30.017103 30.017103 0 1 1 60.034207 0v390.877944a30.251246 30.251246 0 0 1-30.017104 30.017104z m-84.291398-374.628436l4.448713 390.877944-60.596149 0.561943L570.17893 417.710706z" p-id="2764"></path><path d="M566.526302 26.832762l4.448713 390.877944-60.596149 0.561942-4.448713-390.877944z" p-id="2765"></path></svg>
      </div>
      <div class="bf-button gld_rotate" :title="ctrXbim.flagRotate?'停止旋转':'旋转预览'" @click="toggleRotate">
        <svg t="1628840249030" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3782" width="200" height="200"><path d="M164.778667 263.978667a425.258667 425.258667 0 0 1 236.8-164.096C629.162667 38.826667 863.146667 173.952 924.117333 401.493333c61.013333 227.626667-74.069333 461.610667-301.653333 522.581334C394.794667 985.173333 160.853333 850.048 99.84 622.506667l82.432-22.101334a341.333333 341.333333 0 1 0 54.570667-290.432l80.384 51.2-182.912 54.101334L85.333333 213.333333l79.445334 50.645334z" p-id="3783"></path><path d="M512 512m-85.333333 0a85.333333 85.333333 0 1 0 170.666666 0 85.333333 85.333333 0 1 0-170.666666 0Z" p-id="3784"></path></svg>
      </div>
      <div class="bf-button gld_roam" :title="ctrXbim.flagWalking?'退出漫游':'进入漫游'" @click="toggleWalking">
        <svg t="1628840315795" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4233" width="200" height="200"><path d="M512 269.27407445c72.81777778 0 131.072-53.39970333 131.072-121.36296334S584.81777778 26.54814777 512 26.54814777 380.928 79.94785223 380.928 147.91111111 439.18222222 269.27407445 512 269.27407445z m165.05363001 116.50844445c-4.8545189-29.12711111-29.12711111-53.39970333-63.10874112-53.39970447h-33.98163001c-9.70903666 0-14.56355555 4.8545189-24.27259221 9.7090378l-43.69066667 33.98162887-43.69066667-38.83614777c-4.8545189-4.8545189-14.56355555-9.70903666-24.27259221-9.70903666h-33.98163001c-33.98163001 0-63.10874112 24.27259221-63.10874112 53.39970333L317.81925888 599.38133333c0 9.70903666 0 19.41807445 9.70903779 24.27259222 4.8545189 4.8545189 14.56355555 9.70903666 24.27259222 9.70903779h33.98163001l29.12711111 310.68918443c4.8545189 29.12711111 29.12711111 53.39970333 63.10873998 53.39970446h72.81777778c33.98163001 0 63.10874112-24.27259221 63.10874112-53.39970446l29.12711111-310.68918443h33.98163001c9.70903666 0 19.41807445-4.8545189 24.27259221-9.70903779 4.8545189-9.70903666 4.8545189-14.56355555 4.8545189-24.27259222l-29.12711111-213.59881443z" p-id="4234"></path></svg>
      </div>
      <div class="bf-button" title='标记' @mouseover="Markingnter" @mouseout="Markingout">
        <svg  t="1628840461855" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5529" width="200" height="200"><path d="M184 102.5l65.155-20.597a389.5 389.5 0 0 1 162.65-15.187 195.17 195.17 0 0 1 65.878 20.11l102.976 52.382c71.798 36.284 156.398 37.06 228.85 2.097l59.438-28.868a24.674 24.674 0 0 1 35.456 22.206v446.052a24.674 24.674 0 0 1-13.891 22.207l-60.031 29.152a308.089 308.089 0 0 1-133.942 30.793h-2.183a308.015 308.015 0 0 1-135.632-32.767L452.726 576.66a146.29 146.29 0 0 0-49.089-14.804 340.337 340.337 0 0 0-143.009 13.755L184 600.211V928c0 17.673-14.327 32-32 32-17.673 0-32-14.327-32-32V96c0-17.673 14.327-32 32-32 17.673 0 32 14.327 32 32v6.5z m0 65.118v377.608l73.053-23.46a372.993 372.993 0 0 1 113.2-17.646 378.17 378.17 0 0 1 43.563 2.53 187.192 187.192 0 0 1 62.844 18.98l101.516 51.163a247.506 247.506 0 0 0 218.32 1.596l44.188-21.475v-374.77L817.715 193.3a295.031 295.031 0 0 1-130.9 29.488 294.892 294.892 0 0 1-130.332-31.91l-98.62-50.183a139.8 139.8 0 0 0-47.131-14.419 325.873 325.873 0 0 0-136.122 12.706L184 167.618z" p-id="5530"></path></svg>
        <div class="remove_toolbar hidden">
          <!-- 标记 -->
          <div class="bf-button gld_sign" :title="ctrXbim.flagMarking?'退出标记':'标记模式'" @click="toggleMarking">
            <svg t="1629076450923" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1905" width="200" height="200"><path d="M957.6 507.4L603.2 158.2c-3.1-3.1-8.1-3.1-11.2 0L353.3 393.4c-3.1 3.1-3.2 8.2-0.1 11.3l0.1 0.1 40 39.4-117.2 115.3c-3.1 3.1-3.2 8.2-0.1 11.3l0.1 0.1 39.5 38.9-189.1 187H72.1c-4.4 0-8.1 3.6-8.1 8V860c0 4.4 3.6 8 8 8h344.9c2.1 0 4.1-0.8 5.6-2.3l76.1-75.6 40.4 39.8c3.1 3.1 8.1 3.1 11.2 0l117.1-115.6 40.1 39.5c3.1 3.1 8.1 3.1 11.2 0l238.7-235.2c3.4-3 3.4-8 0.3-11.2zM389.8 796.2H229.6l134.4-133 80.1 78.9-54.3 54.1z m154.8-62.1L373.2 565.2l68.6-67.6 171.4 168.9-68.6 67.6zM713.1 658L450.3 399.1 597.6 254l262.8 259-147.3 145z" p-id="1906"></path></svg>
          </div>
          <!-- 清空标记 -->
          <div class="bf-button gld_remove" title="清空标记" @click="clearMarking">
            <svg t="1628846031694" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3884" width="200" height="200"><path d="M876.564398 512.149985h30.697002c7.699248 0 15.398496 0 22.997754-2.599746 33.296748-8.999121 46.095498-43.495752 37.096378-104.889757-3.799629-28.197246-24.297627-46.095498-54.99463-46.095498H614.290011v-24.297627c0-65.293624-3.799629-130.487257 0-195.780881C616.889757 75.792598 589.992384 18.198223 537.49751 2.899717c-15.398496-3.799629-38.39625-3.799629-51.195 0C458.105263 13.098721 421.008886 39.996094 413.409628 79.692218c-2.599746 12.79875-3.799629 24.297627-3.799629 35.796504v243.076262H113.938873c-40.896006 0-60.094131 19.198125-60.094131 61.394004v7.699249c0 72.892882 7.699248 80.59213 80.592129 84.491748 2.599746 0 6.399375 1.299873 10.199004 1.299873-28.197246 145.885753-56.294502 290.471634-86.991504 435.057514-7.699248 35.796504 0 62.693878 30.697002 75.492628h844.417537c29.397129-12.79875 38.39625-38.39625 31.996876-72.892882-30.597012-145.985744-58.794258-290.571624-88.191388-438.957133zM509.300264 54.094717c31.996875 0 52.494874 22.997754 52.494873 61.394005 0 74.192755 1.299873 147.185626 1.299873 221.378381v21.797871H459.405136V115.488722c0-37.096377 19.198125-60.194122 49.895128-61.394005zM102.439996 460.954985v-51.195001h818.820037V460.954985H102.439996z m200.880383 511.750024c8.999121-63.993751 17.898252-133.087003 26.897373-199.580509 1.299873-11.498877 2.599746-21.797871 3.799629-31.996876 1.299873-15.398496-3.799629-28.197246-19.198125-30.697002-17.898252-2.599746-28.197246 6.399375-30.697002 22.997754-6.399375 42.195879-11.498877 83.191876-17.898252 125.387755-3.799629 37.096377-8.999121 75.492628-14.098624 113.888878H103.739869c33.296748-153.585001 66.493506-307.070013 101.090128-460.655014h610.340397c33.296748 153.585001 66.493506 307.070013 101.090127 460.655014h-612.940142z" p-id="3885"></path></svg>
          </div>
        </div>
      </div>
      <div class="bf-button gld_details" :title="Attribute_details?'退出详情':'信息详情'" @click="toggleDetails">
        <svg t="1628842947918" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1905" width="200" height="200"><path d="M896.174 63.868l-832.162 0.078v831.693h384.075V831.72l-320.062 0.044-0.035-703.774h704.171v320.218h64.012V63.868z" p-id="1906"></path><path d="M192.08 319.871h384.075v-63.919H192.08v63.919z m0 127.768l320.062 0.069V383.79H192.08v63.849z m0 128.317h192.037v-63.891l-192.037-0.028v63.919z m0 0M705.643 895.619C595.51 897.227 513.32 802.618 513.32 703.408c0-113.439 91.234-192.041 192.323-192.041 118.069 0 192.887 99.598 192.323 192.041-0.633 103.519-81.629 189.647-192.323 192.211z m0-320.238c-72.702 0-128.215 55.33-128.215 128.027 0 72.699 55.514 128.027 128.215 128.027s128.215-55.328 128.215-128.027c0-72.697-55.514-128.027-128.215-128.027z" p-id="1907"></path><path d="M922.723 959.71L801.836 838.828l36.688-36.685 121.7 121.694" p-id="1908"></path></svg>
      </div>
      <div class="bf-button gld_flag" :title="flag?'隐藏选中':'显示选中'" @click="toggleflag">
        <svg v-if="flag===false" t="1629076892265" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2081" width="200" height="200"><path d="M512 895.581091c-284.811636 0-465.454545-264.424727-465.454545-376.040727v-13.218909c0-111.616 180.642909-376.087273 465.454545-376.087273 287.604364 0 464.477091 260.794182 465.454545 375.482182v13.777454c-0.977455 115.153455-177.803636 376.087273-465.454545 376.087273z m0-695.482182c-240.221091 0-395.636364 227.560727-395.636364 306.269091v13.218909c0 78.708364 155.415273 306.222545 395.636364 306.222546 236.404364 0 394.845091-218.158545 395.636364-306.501819v-13.218909c-0.791273-88.064-159.232-305.989818-395.636364-305.989818z m0 495.709091a183.109818 183.109818 0 0 1-182.923636-182.877091c0-100.864 82.059636-182.923636 182.923636-182.923636s182.923636 82.059636 182.923636 182.923636A183.109818 183.109818 0 0 1 512 695.808z m0-295.982545c-62.370909 0-113.105455 50.734545-113.105455 113.105454 0 62.324364 50.734545 113.058909 113.105455 113.058909s113.105455-50.734545 113.105455-113.058909c0-62.370909-50.734545-113.105455-113.105455-113.105454z" p-id="2082"></path></svg>
        <svg v-else t="1629081891396" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3053" width="200" height="200"><path d="M944.1 462.9c-0.2-0.1-0.4-0.2-0.5-0.4-3.7-2.8-17-12.8-34.4-24.8-1.6-1.1-2-2.7-2-3.5-0.1-0.8 0-2.3 1.4-3.7 13.5-13 26.6-26.6 39-40.6 0.6-0.6 1-1.2 1.5-1.8 12.5-16.6 13-39.2 1.2-56.3-2-2.9-4.4-5.4-7.2-7.3-5.4-3.8-11.7-5.2-18-4.2-12 1.9-20.8 12.1-26.4 19.7-46.3 58.6-205.3 210.2-385.6 210.3-48-0.5-95.1-8.9-140.1-25l-39.7-16.1c-37.8-17.1-74-38-107.5-62.2l-28.1-21.1c-25.5-19.6-49.1-41.8-70-66-0.7-0.8-1.4-1.6-2.2-2.3l-1.8-1.7c-6.2-5.8-11.5-10.8-17.8-13.5-5.3-2.3-15.8-4.6-26.6 5-19 17-14.2 41.3-3.3 58.4 1.1 1.7 2.4 3.3 3.8 4.8 15.9 16 32.7 31.5 50.1 46 1.5 1.3 1.7 2.9 1.7 3.7 0 0.8-0.3 2.4-2 3.6-12.7 9-22.1 15.9-24.7 17.8-0.1 0-0.2 0.1-0.7 0.4-7.8 4.5-13.3 11.7-15.5 20.2-2.4 8.9-0.8 18.4 4.3 26.1 9.5 15.5 29.7 20.8 46 12.1 5.6-3 11.8-7.6 20.5-14 7.4-5.5 16.6-12.3 28.2-20.1 1.7-1.2 4-1.1 5.8 0.1 28.8 19.9 59.4 37.9 90.8 53.6 1.6 0.8 2.3 2.2 2.5 2.9 0.2 0.7 0.5 2.1-0.4 3.6l-28.7 48.3c-4.6 7.6-5.8 16.6-3.5 25.1 2.3 8.6 7.9 15.8 15.9 20.3l0.2 0.1c16.2 8.9 37 3.5 46.5-12l32.9-56.2c1.2-2.1 3.8-2.9 6.1-2.1 38.2 14 78.1 23.2 118.7 27.4 2.6 0.3 4.5 2.3 4.5 4.7V671c0 18.3 15.4 33.3 34.3 33.3s34.3-14.9 34.3-33.3v-49.6c0-2.4 1.9-4.4 4.5-4.7 40.1-4.2 79.5-13.7 117-28.2 2.3-0.9 5 0 6.2 2l34.2 58.5 0.1 0.1c9.5 15.7 29.7 21.1 46.1 12.4l0.3-0.2c7.9-4.5 13.5-11.7 15.8-20.3 2.3-8.5 1.1-17.4-3.5-25L737 562.4c-1.3-2.2-0.5-5.1 1.9-6.4 38.7-21.1 75.7-45.8 110-73.3 1.7-1.4 4.2-1.5 6-0.3 25.1 16.5 45.5 31.2 51.1 35.4 1.9 1.4 3.8 2.5 5.8 3.3 15.9 6.7 34.5 0.9 43.3-13.6 9.2-15.3 4.4-34.9-11-44.6z" p-id="3054"></path></svg>
      </div>
      <div class="bf-button gld_details" :title="camera?'透视相机':'正交相机'" @click="cameraChange">
        <svg t="1630378276365" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2421" width="200" height="200"><path d="M918.266075 186.599512h-27.419435v-52.133253c0-34.999049-28.362921-63.376296-63.36197-63.376296H617.628525c-34.999049 0-63.36197 28.376224-63.36197 63.376296v52.133253H105.754391c-54.465364 0-98.777503 44.313163-98.777503 98.770341v459.460494c0 54.457177 44.313163 98.757037 98.777503 98.757038h183.51425c51.647184 66.461558 132.248759 109.323676 222.740569 109.323675 90.486693 0 171.109757-42.862118 222.748755-109.323675h183.50811c54.4582 0 98.757037-44.29986 98.757037-98.757038V285.369853c0-54.457177-44.298837-98.77034-98.757037-98.770341z m-300.63755-52.133253H827.48467v52.133253H617.628525v-52.133253zM512.00921 889.533741c-120.588208 0-218.704657-98.108262-218.704657-218.689307 0-120.597418 98.116449-218.692377 218.704657-218.692377 120.597418 0 218.70568 98.094959 218.70568 218.692377 0 120.581045-98.108262 218.689307-218.70568 218.689307z m406.256865-109.30935H771.997026c14.231091-33.66159 22.093137-70.619243 22.093137-109.379957 0-155.540185-126.527465-282.068673-282.080953-282.068674-155.530975 0-282.072767 126.527465-282.072767 282.068674 0 38.760715 7.869209 75.718368 22.078811 109.379957h-146.260863c-19.507247 0-35.401207-15.892937-35.401207-35.394044v-402.649718h652.216205c11.665667 0 21.122021-9.441004 21.122021-21.106671 0-11.666691-9.45533-21.135324-21.122021-21.135324H70.353184v-14.568781c0-19.528736 15.892937-35.394044 35.401207-35.394045h812.511684c19.51441 0 35.379718 15.865308 35.379718 35.394045v14.568781H841.292113c-11.665667 0-21.120998 9.468633-21.120997 21.135324 0 11.665667 9.454307 21.106671 21.120997 21.106671h112.35368v402.648695c0 19.501107-15.865308 35.395067-35.379718 35.395067z" p-id="2422"></path><path d="M661.363521 609.60889c-4.424767-10.792789-16.766839-15.935916-27.560651-11.526498-10.792789 4.424767-15.964568 16.766839-11.538778 27.546324 5.875812 14.356957 8.861814 29.560187 8.861814 45.215718 0 65.672591-53.42978 119.101347-119.116696 119.101347-65.679754 0-119.122836-53.428756-119.122837-119.101347 0-65.68794 53.444106-119.116697 119.122837-119.116697 16.091458 0 31.674333 3.141544 46.356701 9.341744 10.736507 4.563937 23.15021-0.493233 27.700844-11.244066 4.523004-10.750833-0.506536-23.13486-11.258393-27.672191-19.908382-8.412583-41.042683-12.667482-62.799152-12.667482-88.977319 0-161.357669 72.366023-161.357669 161.359715 0 88.977319 72.379326 161.370972 161.357669 161.370972 88.979366 0 161.358692-72.393652 161.358692-161.370972 0-21.193652-4.028748-41.792765-12.004381-61.236567z" p-id="2423"></path><path d="M512.00921 612.975561c-31.955742 0-57.881153 25.897782-57.881153 57.868873 0 31.955742 25.925411 57.8525 57.881153 57.8525 31.956765 0 57.882176-25.897782 57.882176-57.8525 0.001023-31.971092-25.925411-57.868873-57.882176-57.868873z" p-id="2424"></path></svg>
      </div>
      <div class="bf-button gld_details" :title="!isFullscreen?'全屏':'退出全屏'" @click="isScreenFull">
        <svg v-if="!isFullscreen" t="1629082755184" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3877" width="200" height="200"><path d="M628.053333 628.053333a32 32 0 0 1 45.226667 0l158.72 158.634667V693.333333l0.298667-4.352A32 32 0 0 1 896 693.333333v181.333334l-0.341333 3.84a21.333333 21.333333 0 0 1-20.992 17.493333h-181.333334l-4.352-0.298667a32 32 0 0 1-27.648-31.701333l0.298667-4.352a32 32 0 0 1 31.701333-27.648h93.44l-158.72-158.72-3.114666-3.584a32 32 0 0 1 3.114666-41.642667z m-232.106666 0a32 32 0 0 1 3.114666 41.642667l-3.114666 3.584-158.72 158.72h93.44a32 32 0 0 1 31.701333 27.648l0.298667 4.352a32 32 0 0 1-27.648 31.701333L330.666667 896H149.333333a21.333333 21.333333 0 0 1-20.992-17.493333L128 874.666667v-181.333334a32 32 0 0 1 63.701333-4.352l0.298667 4.352v93.354667l158.72-158.634667a32 32 0 0 1 45.226667 0zM874.666667 128a21.333333 21.333333 0 0 1 20.992 17.493333L896 149.333333v181.333334a32 32 0 0 1-63.701333 4.352L832 330.666667V237.312L673.28 395.946667a32 32 0 0 1-48.341333-41.642667l3.114666-3.584 158.72-158.72h-93.44a32 32 0 0 1-31.701333-27.648L661.333333 160a32 32 0 0 1 27.648-31.701333L693.333333 128h181.333334zM330.666667 128l4.352 0.298667a32 32 0 0 1 27.648 31.701333l-0.298667 4.352a32 32 0 0 1-31.701333 27.648H237.226667l158.72 158.72 3.114666 3.584a32 32 0 0 1-48.341333 41.642667L192 237.312V330.666667l-0.298667 4.352A32 32 0 0 1 128 330.666667V149.333333l0.341333-3.84A21.333333 21.333333 0 0 1 149.333333 128h181.333334z" p-id="3878"></path></svg>
        <svg v-else t="1629084013198" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2512" width="200" height="200"><path d="M749.248 704H864a32 32 0 1 0 0-64H672a32 32 0 0 0-32 32v192a32 32 0 1 0 64 0v-114.752l137.36 137.36a32 32 0 1 0 45.232-45.264L749.248 704zM320 749.248V864a32 32 0 1 0 64 0V672a32 32 0 0 0-32-32H160a32 32 0 1 0 0 64h114.752l-137.36 137.36a32 32 0 1 0 45.264 45.232L320 749.248zM749.248 320H864a32 32 0 1 1 0 64H672a32 32 0 0 1-32-32V160a32 32 0 1 1 64 0v114.752l137.36-137.36a32 32 0 1 1 45.232 45.264L749.248 320zM320 274.752V160a32 32 0 1 1 64 0v192a32 32 0 0 1-32 32H160a32 32 0 1 1 0-64h114.752l-137.36-137.36a32 32 0 1 1 45.264-45.232L320 274.752z" p-id="2513"></path></svg>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import "./font/iconfont";
import "./font/iconfont.css";
import "./index.scss";
import { Options, Vue } from "vue-class-component";
import axios from "axios";
import { mapState, mapActions, mapMutations } from "vuex";
import XbimCenter from "./XbimCenter";
import Tree from "./plugins/Tree.vue";
import { ElMessage } from 'element-plus'
import screenfull from "screenfull";
import _ from "lodash"
@Options({
  components: { Tree },
  props: {
    config: {
      type: Array,
      default() {
        return [];
      }
    }
  },
  computed: {
    ...mapState([])
  },
  watch: {
    flagMeasuring(flag) {
      if (!flag) {
        this.clearMeasure();
      }
    },
    flagClipping(flag) {
      if (!flag) {
        this.resetPlane();
      }
    }
  }
})
export default class xBim extends Vue {
  loadingDetail = false;
  // 完成接口传输赋值
  prodDataLoaded(data: any) {
    this.loadingDetail = false;
    this.detailData = data;
  }
  getDetailInfo(data: any) {
    console.log(data);
    let id = data.parId;
    // fromModelClick 是否是从点击3d模型来的，点击3d模型返回的一定是零件id
    if (data.fromModelClick) {
      // 如果是零件，通过接口获取详细信息
      this.loadingDetail = true;
      if (data.id) {
        axios({
          url: 'http://192.168.0.117:9001/bimwebservice/ifcfile/select/structure',
          method: "post",
          headers: {
            accessToken: this.token
          },
          data: {
            filePath: 'http://192.168.0.117:9002//2020SJ036 杭政储出[2020]18号地块商品住宅4#楼\\三维模型管理\\模型1\\sushelou.ifc',
            fileid: '3108',
            label: data.id,
            type: 0
          }
        }).then(res => {
          if (res.data.code===0) {
            // console.log(res.data.data);
            this.prodDataLoaded(JSON.parse(res.data.data));
          }
        })
        this.sendMsgToPar("loadProdData", {
          id: data.id
        });
      }
    } else {
      // 否则直接从json将数据渲染
      let detailData: any = {};
      for (let key in data) {
        if (key != "parts") {
          // 过滤零件列表
          detailData[key] = data[key];
        }
      }
      this.detailData = detailData;
    }
  }
  changeClipPrg() {
    this.ctrXbim.moveClippingplane(this.progress);
  }
  // 目录树双击方法
  doLookAt(list: any) {
    this.ctrXbim.doLookAt(list);
  }
  // 目录树单击方法
  selInModel(list: any[], id: Number) {
    this.ctrXbim.selectedData = { id: 1, model: 1 };
    this.ctrXbim.selectedChildren = list;
    this.ctrXbim.ComponentID = id
    if (this.Modeflag) {
      _.forIn(this.stateTree, (value, key) => {                  
        if (value.includes(id)) {
          this.ctrXbim.state = key
          // 更新高亮
          this.ctrXbim.updateSelHighlight();
          return false
        }
      })
    } else {
      this.ctrXbim.updateSelHighlight();
    }
  }
  detailData: any = {};

  checkSelectedProdIds(data: any) {
    this.getDetailInfo(data);
  }
  clearMarking() {
    this.ctrXbim.ctrMarking.clearAll();
  }
  get progress() {
    return this.ctrXbim.lastPrg;
  }
  set progress(val: number) {
    this.ctrXbim.lastPrg = val;
  }
  loading = false;
  searchKey = "";
  dataTree: any[] = [];
  style = "";
  selData = {};
  ctrXbim: XbimCenter = new XbimCenter();
  selAxis = "";
  Attribute_details = false;
  flag = true;
  isFullscreen = false;
  Modeflag = false
  colorkey: any[] = []
  stateUrl= "" // 状态接口
  fid= "" // 文件id
  token= ""
  camera= false
  stateTree: any[] = []
  get self() {
    return this as any;
  }
  async mounted() {
    window.addEventListener("message", this.onParMsg);

    document.addEventListener("keydown", this.onKeyDown);
    document.addEventListener("keyup", this.onKeyUp);
    this.onUpdate();
    this.ctrXbim.init(this.$refs.canvas);

    this.ctrXbim.onUpdateSel = data => {
      this.checkSelectedProdIds(data);
    };
    // 模拟文件
    let res: any = await this.loadFile("/model/臻圆Y01mx.wexbim");
    let dataTree: any = await this.loadJson("/model/臻圆Y01mx.json");
    dataTree.model = res.model;
    this.dataTree.push(dataTree);
    this.dataTree = this.dataTree.concat();
    // 保存json构件树    
    let newdataTree = _.cloneDeep(this.dataTree[0].children)
    newdataTree.forEach(item => {
      return item.parts = item.parts.split(',')
    })
    this.ctrXbim.newDataTree = newdataTree;
    (window as any).doDraw = this.doDraw;
    (window as any).url = this.getstateurl;
    (window as any).token = this.gettoken;    
    this.sendMsgToPar("222", { a: 2 });
  }
  // iframe接收接口零件数据
  onParMsg(event: any) {
    // console.log('触发了单击')
    var origin = event.origin;
    // 验证一次消息来源，也可不加
    // if (origin !== "http://example.org:8080")
    //   return;

    console.log(event.data, "eeeeeeeeeee");
    try {
      let data = JSON.parse(event.data);
      switch (data.type) {        
        case "prodDataLoaded": {
        console.log(data.type);
          this.prodDataLoaded(data.data);
          break;
        }
      }
    } catch (e) {}
  }
  sendMsgToPar(type = "", data = {}) {
    window.parent.postMessage(JSON.stringify({ type, data }), "*");
  }
  lastTime!: number;
  onUpdate(time?: number) {
    if (time) {
      let timeOffset = time - this.lastTime;
      this.lastTime = time;
      this.handleKeyEvent(timeOffset);
    }
    // Do whatever
    requestAnimationFrame(this.onUpdate);
  }
  doDraw(dataTree: any, dataModel: Blob) {
    this.loading = true;
    // let newdataTree = _.cloneDeep(dataTree.children)
    // newdataTree.forEach(item => {
    //   return item.parts = item.parts.split(',')
    // })
    // this.ctrXbim.newDataTree = newdataTree;
    // return;
    this.ctrXbim.loadView(dataModel, (res: any) => {
      this.loading = false;
      dataTree.model = res.model;
      this.dataTree.push(dataTree);
      // 触发数组set监听
      this.dataTree = this.dataTree.concat();
      // 加载进度
      // this.ctrXbim.viewer.loadAsync(dataModel, "base", {accessToken: this.token}, (msg) => {
      //   // console.log(MessageProgress(msg).toFixed(2));
      //   console.log(msg.percent);
        
      //   // progress.innerHTML = `[${MessageProgress(msg).toFixed(2)}%] ${msg.message}`;
      // });
    });
  }
  // 获得状态接口
  getstateurl(data: any) {
    this.stateUrl = data.data
    this.fid = data.fid
    this.ctrXbim.fid = data.fid
  }
  // 获得回显状态接口
  gettoken(data: any) {
    this.token = data.token
    this.ctrXbim.token = data.token
  }
  printData() {
    // console.log(Object.prototype.toString.call(this.detailData))
    console.log(Object.keys(this.detailData))
  }
  resetPlane() {
    this.progress = 50;
    this.ctrXbim.resetClipBox();
  }
  downKey = "";
  onKeyUp(evt: any) {
    if (evt.key == this.downKey) {
      this.downKey = "";
    }
  }
  onKeyDown(evt: any) {
    this.downKey = evt.key;
  }
  handleKeyEvent(timeOffset: number) {
    switch (this.downKey) {
      case "w": {
        this.ctrXbim.walk(1, timeOffset);
        break;
      }
      case "a": {
        this.ctrXbim.walk(4, timeOffset);
        break;
      }
      case "s": {
        this.ctrXbim.walk(3, timeOffset);
        break;
      }
      case "d": {
        this.ctrXbim.walk(2, timeOffset);
        break;
      }
    }
  }
  loadJson(url: string) {
    return new Promise(rsv => {
      axios({
        url,
        method: "get"
      }).then(e => {
        rsv(e.data);
      });
    });
  }
  loadFile(url: string) {
    return new Promise(rsv => {
      this.loading = true;
      axios({
        url,
        method: "get",
        responseType: "blob"
      }).then(e => {
        let blob = e.data;
        // console.log(blob, "blobblobblobblobblobblob");
        // todo:loadView的性能明显优于loadViewAsync。原因待排查
        this.ctrXbim.loadView(blob, (e: any) => {
          this.loading = false;
          rsv(e);
        });
      });
    });
  }
  hideItems(idList: number[]) {
    this.ctrXbim.hideItems(idList, 1);
  }
  // 更改相机模式
  cameraChange() {
    this.camera = !this.camera
    if (this.camera) {
      this.ctrXbim.viewer.camera = 1
    } else {
      this.ctrXbim.viewer.camera = 0
    }
  }
  // 视图模式切换
  toggleChange() {
    const dom = document.getElementsByClassName("gld_mode")[0]
    this.Modeflag? dom.classList.remove('active') : dom.classList.add('active')
    this.Modeflag = !this.Modeflag
    const tree = JSON.parse(JSON.stringify(this.dataTree[0].children))
    if(this.Modeflag) {
      this.ctrXbim.hilightedDataList = []
      this.ctrXbim.stateFlag = true
      axios({
        url: 'http://192.168.0.117:9001/bimwebservice/ifcfile/select/structures/status',
        // url: this.stateUrl,
        headers: {
          accessToken: this.token
        },
        method: "post",
        data: {
          fid: '3108'
          // fid: this.fid
        }
      }).then(res => {
        if (res.data.code===0) {          
          const data = JSON.parse(res.data.data)
          this.ctrXbim.stateTree = data;
          this.stateTree = data;
          _.forIn(data, (value,key) => {
            this.colorkey.push(key)
          })
          const IN_TRANSPORT: any[] = [] // 运输中
          const IN_PRODUCED: any[] = [] // 加工中
          const IN_INSTALL: any[] = [] // 安装中
          const NOT_PRODUCED: any[] = [] // 未开始
          const PRODUCED_COMPLETED: any[] = [] // 加工完成
          const INSTALL_COMPLETED: any[] = [] // 安装完成
          const TRANSPORT_COMPLETED: any[] = [] // 运输完成
          data.运输中.forEach(item => {
            _.find(tree, ['id', item]).parts.split(",").forEach(element => {
              IN_TRANSPORT.push(element)
            })
          })
          data.加工中.forEach(item => {
            _.find(tree, ['id', item]).parts.split(",").forEach(element => {
              IN_PRODUCED.push(element)
            })
          })
          data.安装中.forEach(item => {
            _.find(tree, ['id', item]).parts.split(",").forEach(element => {
              IN_INSTALL.push(element)
            })
          })
          data.未开始.forEach(item => {
            _.find(tree, ['id', item]).parts.split(",").forEach(element => {
              NOT_PRODUCED.push(element)
            })
          })
          data.加工完成.forEach(item => {
            _.find(tree, ['id', item]).parts.split(",").forEach(element => {
              PRODUCED_COMPLETED.push(element)
            })
          })
          data.安装完成.forEach(item => {
            _.find(tree, ['id', item]).parts.split(",").forEach(element => {
              INSTALL_COMPLETED.push(element)
            })
          })
          data.运输完成.forEach(item => {
            _.find(tree, ['id', item]).parts.split(",").forEach(element => {
              TRANSPORT_COMPLETED.push(element)
            })
          })
          this.ctrXbim.IN_TRANSPORT_DataList = IN_TRANSPORT
          this.ctrXbim.IN_PRODUCED_DataList = IN_PRODUCED
          this.ctrXbim.IN_INSTALL_DataList = IN_INSTALL
          this.ctrXbim.NOT_PRODUCED_DataList = NOT_PRODUCED
          this.ctrXbim.PRODUCED_COMPLETED_DataList = PRODUCED_COMPLETED
          this.ctrXbim.INSTALL_COMPLETED_DataList = INSTALL_COMPLETED
          this.ctrXbim.TRANSPORT_COMPLETED_DataList = TRANSPORT_COMPLETED
          this.ctrXbim.updateState()
        }
      })
      // console.log(JSON.parse(JSON.stringify(this.dataTree[0].children)));
      
    } else {
      this.ctrXbim.stateFlag = false
      this.ctrXbim.resetState()
    }
  }
  // 旋转
  toggleRotate() {
    const dom = document.getElementsByClassName("gld_rotate")[0]
    this.ctrXbim.flagRotate ? dom.classList.remove('active') : dom.classList.add('active')
    this.ctrXbim.flagRotate = !this.ctrXbim.flagRotate;
  }
  // 测量
  toggleMeasure() {
    const dom = document.getElementsByClassName("gld_measure")[0]
    this.ctrXbim.flagMeasuring ? dom.classList.remove('active') : dom.classList.add('active')
    this.ctrXbim.flagMeasuring = !this.ctrXbim.flagMeasuring;
  }
  // 漫游
  toggleWalking() {
    const dom = document.getElementsByClassName("gld_roam")[0]
    this.ctrXbim.flagWalking ? dom.classList.remove('active') : dom.classList.add('active')
    this.ctrXbim.flagWalking = !this.ctrXbim.flagWalking;
  }
  // 标记
  toggleMarking() {
    // if (this.ctrXbim.flagMarking) {
    //   this.clearMarking()
    //   return false
    // }
    const dom = document.getElementsByClassName("gld_sign")[0]
    this.ctrXbim.flagMarking ? dom.classList.remove('active') : dom.classList.add('active')
    this.ctrXbim.flagMarking = !this.ctrXbim.flagMarking;
  }
  Markingnter() {
    const dom = document.getElementsByClassName("remove_toolbar")[0]
    dom.classList.add('display')
    dom.classList.remove('hidden')
  }
  Markingout() {
    const dom = document.getElementsByClassName("remove_toolbar")[0]
    dom.classList.add('hidden')
    dom.classList.remove('display')
  }
  // 剖切
  toggleClipping() {
    const dom = document.getElementsByClassName("gld_Sectioning")[0]
    this.ctrXbim.flagClipping ? dom.classList.remove('active') : dom.classList.add('active')
    this.ctrXbim.flagClipping = !this.ctrXbim.flagClipping;
  }
  // 详情
  toggleDetails() {
    const dom = document.getElementsByClassName("gld_details")[0]
    this.Attribute_details ? dom.classList.remove('active') : dom.classList.add('active')
    this.Attribute_details = !this.Attribute_details;
  }
  remove() {
    this.Attribute_details =false
    const dom = document.getElementsByClassName("gld_details")[0]
    dom.classList.remove('active')
  }
  toggleflag() {
    this.flag = !this.flag
  }
  isScreenFull() {
    this.isFullscreen = !this.isFullscreen
    // 需要注意的是 如果判断!screenfull.enabled 显示的是不支持全屏的话 是因为谷歌的版本问题  判断改为 !screenfull.isEnabled  就可以了
    if (!screenfull.isEnabled) {
      // 如果不支持进入全屏，发出不支持提示
      ElMessage.warning({
        message: '浏览器不支持全屏',
        type: 'warning'
      });
      return false;
    }
    screenfull.toggle();
  }
  
  cancelSelClipPlane() {
    this.ctrXbim.cancelSelClipPlane();
  }
  toggleClippingPlane() {
    const dom = document.getElementsByClassName("able")[0]
    !this.ctrXbim.showClipping ? dom.classList.remove('active') : dom.classList.add('active')
    this.ctrXbim.showClipping = !this.ctrXbim.showClipping;
  }
  toggleCreateClip() {
    if (this.ctrXbim.clippingPlanes.length>=2) {
      ElMessage.warning({
        message: '最多只能创建2个剖切面',
        type: 'warning'
      });
      return
    }
    this.ctrXbim.flagCreateNew = !this.ctrXbim.flagCreateNew;
  }
}
</script>
